Revit 2027 API
BuiltInFailures.GenericMEPFailures.FlowDirectionMismatch Property
 [Element Name]: It is not possible to calculate the flow since the flow direction mismatch. Please check flow direction on all equipment in this system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FlowDirectionMismatch { get; }
Public Shared ReadOnly Property FlowDirectionMismatch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FlowDirectionMismatch {
	FailureDefinitionId^ get ();
}
static member FlowDirectionMismatch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GenericMEPFailures Class
Autodesk.Revit.DB Namespace